using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//Сформировать и заполнить случайными значениями массив A ссылок на целочисленные массивы.Количество ссылок в массиве A получить от пользователя.Количество элементов в каждом целочисленном массиве – случайное число из диапазона (0;15). Написать метод, формирующий по переданному в параметре массиву ссылок на целочисленные массивы новый массив, в котором сохранены только элементы, распложенные в нечетных столбцах исходного.Используя метод, сформировать из массива A «подмассив» B.A и  В вывести на экран.
//Сформировать двумерный целочисленный массив размером MxN, заполнить его случайными значениями (M и N задаются с клавиатуры). Преобразовать этот двумерный массив в массив массивов.Вычислить и вывести на экран сумму и произведение элементов k-ого столбца массива массивов(k – задается с клавиатуры).

namespace Task11
{
	class Program
	{

		static void Main(string[] args)
		{
		}
	}
}
