using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//Сформировать целочисленную матрицу размером MxN(M и N задаются с клавиатуры) по следующему правилу: элементы i-ой строки равны 10* i.
//Сформировать и заполнить случайными значениями целочисленную матрицу размером MxN (M и N задаются с клавиатуры).  Написать метод, выводящий на экран элементы переданной в качестве параметра матрицы в табличном виде через один в шахматном порядке.Способ вывода (начиная с первого в первой строке или со второго) задаётся параметром логического типа.

namespace Task10
{
	class Program
	{
		static void Main(string[] args)
		{
		}
	}
}
