using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Sem20
{
	/// <summary>
	/// виды связи между объектами
	/// ассоциация - один использует другой
	/// агрегация - целое не управляет временем жизни частей.
	/// слабая связь - в объект кладется уже существующая часть 
	/// композиция - часть создается внутри целого и умирает вместе с ним
	/// кдз полностью на винформе
	/// информация об объектах лежит в файле
	/// они обсуждают какой-то мем про военную кафедру
	/// я не знаю о чем речь
	/// там просто кажется было какое-то аудиосообщение и это .. интересно
	/// они спросили его типа "думаете ли вы что они неправы" и он на 5 минут завис со сложным лицом
	/// я хочу ЗНАТЬ 
	/// спрошу у Андрея
	/// </summary>
	class Program
	{

		static void Main(string[] args)
		{
		}
	}
}
